modules/dfa_axis/src/test/java/com/google/api/ads/dfa/axis/testing/test_request_authenticate.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Header>
    <ns1:RequestHeader soapenv:mustUnderstand="0" xmlns:ns1="http://www.doubleclick.net/dfa-api/#API_VERSION#">
      <ns1:applicationName mustUnderstand="0" actor="">TEST_APP (DfaApi-Java, Dfa-Axis/1.39.0, Common-Java/1.39.0, Axis/1.4, Java/#JAVA_VERSION#, maven)</ns1:applicationName>
    </ns1:RequestHeader>
  </soapenv:Header>
  <soapenv:Body>
    <ns2:authenticate soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns2="http://www.doubleclick.net/dfa-api/#API_VERSION#">
      <username xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">TEST_USERNAME</username>
      <password xsi:type="soapenc:string" xsi:nil="true" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"/>
    </ns2:authenticate>
  </soapenv:Body>
</soapenv:Envelope>
